{
  "backend/main.mo": "Motoko backend handling user profiles, score submission, daily score filtering, progression updates, and access control.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and tests with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file across pages, game logic, UI, and APIs.",
  "frontend/index.css": "Tailwind-based global styles defining light/dark theme CSS variables and base styling tokens.",
  "frontend/index.html": "HTML entry point setting page metadata and loading the main React application; sets title to Neon Doge.",
  "frontend/src/api/useLeaderboards.ts": "React Query hooks fetching daily and all-time leaderboards from the backend actor.",
  "frontend/src/api/useUserProfile.ts": "React Query hooks for retrieving and saving the authenticated user's profile via the backend.",
  "frontend/src/App.tsx": "Main React app controlling game state, viewport setup, authentication checks, and routing between screens.",
  "frontend/src/auth/LoginButton.tsx": "Login/logout button using Internet Identity with query cache clearing and status handling.",
  "frontend/src/auth/ProfileSetupDialog.tsx": "Modal that collects and saves a new user's display name via a profile creation mutation.",
  "frontend/src/components/GameHUD.tsx": "Renders the in‑game HUD showing score, streak, multiplier, coins, time, and pause control.",
  "frontend/src/components/LeaderboardPanel.tsx": "Displays daily and all‑time leaderboards with tab switching, entry listing, and a close button.",
  "frontend/src/components/SettingsDialog.tsx": "Provides UI for toggling sound, reduced motion, and editing keybindings, with a close button.",
  "frontend/src/game/audio/sfx.ts": "Defines simple oscillator‑based sound effects for hit, coin, and power‑up events.",
  "frontend/src/game/balance/difficulty.ts": "Calculates difficulty scaling over time, adjusting obstacle speed, spawn rate, and score multiplier.",
  "frontend/src/game/fx/particles.ts": "Creates particle burst effects with randomized motion, size, and lifetime.",
  "frontend/src/game/fx/screenShake.ts": "Returns a shake intensity value used to trigger screen shake effects.",
  "frontend/src/game/GameCanvas.tsx": "Handles canvas sizing and the render loop, integrating game state, input, and rendering functions.",
  "frontend/src/game/gameTypes.ts": "Defines TypeScript interfaces for all game entities, input state, and game state structure.",
  "frontend/src/game/input/usePlayerInput.ts": "Tracks pointer and keyboard input to update target player position based on bindings and movement rules.",
  "frontend/src/game/renderer.ts": "Renders the full game frame including background, player, obstacles, power‑ups, particles, and screen shake.",
  "frontend/src/game/useGameLoop.ts": "Implements the main game loop, handling updates for obstacles, power-ups, particles, scoring, timers, and game-over events.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity restoration, and state management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query mutations for submitting scores and unlocking perks using the backend actor.",
  "frontend/src/hooks/useVisualViewport.ts": "Tracks visual viewport changes and updates a CSS variable to maintain stable viewport height.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining theme variables, fonts, base styles, and viewport handling.",
  "frontend/src/main.tsx": "Initializes the app root, wrapping it with query and identity providers.",
  "frontend/src/pages/GameScreen.tsx": "Renders the gameplay screen, managing pause state, settings, HUD updates, and passing events to the game canvas.",
  "frontend/src/pages/LandingScreen.tsx": "Displays the main menu with branding, login, navigation to leaderboard, unlocks, settings, and game start.",
  "frontend/src/pages/ResultsScreen.tsx": "Displays final game stats, awards coins, and auto-submits the score if authenticated.",
  "frontend/src/progression/perks.ts": "Defines the list of unlockable perks with their metadata and costs.",
  "frontend/src/progression/UnlocksShop.tsx": "Renders the perk unlock shop where players spend coins to unlock perks.",
  "frontend/src/progression/useProgression.ts": "Manages player progression state, coin balance, perk unlocks, and best score persistence.",
  "frontend/src/settings/settingsTypes.ts": "Declares settings interfaces and default input, audio, and motion settings.",
  "frontend/src/settings/useSettings.ts": "Handles loading, updating, and persisting user settings in localStorage.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, and plugins for the frontend.",
  "project_state.json": "Describes project state, known issues, and pending feature requests for Neon Doge."
}