{
  "backend/main.mo": "Motoko canister handling user auth, profiles, score submission, progression updates, and daily leaderboard management with access control.",
  "feature_evidence.json": "Feature evidence report mapping AAA-upgrade requirements to associated frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles of all major frontend files including game logic, UI, assets, and rendering.",
  "frontend/index.css": "Tailwind CSS theme definitions and color variables for light/dark modes with base styling.",
  "frontend/index.html": "HTML entrypoint preloading high‑resolution assets and bootstrapping the React app.",
  "frontend/src/api/useLeaderboards.ts": "React Query hooks fetching daily and all‑time leaderboards from the canister.",
  "frontend/src/api/useUserProfile.ts": "React Query hooks for loading and saving user profiles through the backend actor.",
  "frontend/src/App.tsx": "Main React app controlling authentication state, game flow, and profile setup gating.",
  "frontend/src/assets/generatedAssets.ts": "Centralized map of all generated high‑resolution game asset URLs.",
  "frontend/src/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with React Query cache reset.",
  "frontend/src/auth/ProfileSetupDialog.tsx": "Modal for first‑time profile creation with name input and save mutation.",
  "frontend/src/components/GameHUD.tsx": "Displays score, streak, coins, and survival time with pause/settings buttons and a formatted HUD layout.",
  "frontend/src/components/GeneratedIcon.tsx": "Renders an icon from a sprite sheet by mapping icon names to coordinates and applying background positioning.",
  "frontend/src/components/LeaderboardPanel.tsx": "Shows daily or all‑time leaderboards with tab switching, loading states, and styled rank entries.",
  "frontend/src/components/SettingsDialog.tsx": "Provides UI for toggling sound, reduced motion, and editing key bindings within a settings modal.",
  "frontend/src/game/audio/sfx.ts": "Simple sound effect generator using Web Audio oscillators for hit, coin, and powerup events.",
  "frontend/src/game/balance/difficulty.ts": "Computes dynamic difficulty values based on elapsed time, adjusting speed, spawn rate, and score multiplier.",
  "frontend/src/game/fx/particles.ts": "Creates radial particle bursts with randomized velocity, size, and color.",
  "frontend/src/game/fx/screenShake.ts": "Returns a shake intensity value for triggering screen shake effects.",
  "frontend/src/game/GameCanvas.tsx": "Canvas-based game renderer that loads assets, manages DPI scaling, handles input, and runs the game loop.",
  "frontend/src/game/gameTypes.ts": "Defines TypeScript interfaces for game entities, particles, input, and the overall game state.",
  "frontend/src/game/input/usePlayerInput.ts": "Tracks pointer and keyboard input to update normalized target movement coordinates based on settings.",
  "frontend/src/game/renderer.ts": "Handles rendering the game canvas, including parallax backgrounds, effects, particles, power‑ups and player movement smoothing.",
  "frontend/src/game/rendererAssets.ts": "Loads and caches game rendering assets like background, token, hazard and UI sprites.",
  "frontend/src/game/useGameLoop.ts": "Implements the main game loop with spawning, movement, collisions, scoring and state updates.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication, identity loading, login handling and context state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query mutations for submitting scores and unlocking perks via the backend actor.",
  "frontend/src/index.css": "Tailwind base styles plus custom color variables, typography, blur, shadows and premium UI effects.",
  "frontend/src/main.tsx": "Bootstraps the app with React, React Query and Internet Identity provider wrappers.",
  "frontend/src/pages/GameScreen.tsx": "Renders the main game screen with canvas, HUD, pause menu and settings dialog, managing game state callbacks.",
  "frontend/src/pages/LandingScreen.tsx": "Landing screen component showing branding, login, settings, and buttons to start the game, open leaderboard, or open unlocks.",
  "frontend/src/pages/ResultsScreen.tsx": "Displays post‑game results, awards coins, submits scores to backend, and shows stats with restart and menu options.",
  "frontend/src/progression/perks.ts": "Defines the list of available perks, including IDs, descriptions, costs, icons, and types.",
  "frontend/src/progression/UnlocksShop.tsx": "UI for viewing and purchasing perks using earned coins, with validation and unlock actions.",
  "frontend/src/progression/useProgression.ts": "Manages player progression in localStorage, including coins, best score, and unlocking perks with optional backend sync.",
  "frontend/src/settings/settingsTypes.ts": "Defines settings structures including sound, motion reduction, and key bindings with default values.",
  "frontend/src/settings/useSettings.ts": "Hook for loading, storing, and updating user settings in localStorage.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom color tokens, extended animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project's state, theme direction, image rework requirements, and a list of existing gameplay and UI features with versioning."
}