{
  "backend/main.mo": "Motoko backend providing user profiles, score submission, progression tracking, and daily leaderboard logic with access control enforcement.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to related source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file for documentation or build planning.",
  "frontend/index.css": "Global Tailwind-based theme variable definitions and dark/light mode styling for the app.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading the main TypeScript bundle.",
  "frontend/src/api/useLeaderboards.ts": "React Query hooks for fetching daily and all‑time leaderboards from the backend actor.",
  "frontend/src/api/useUserProfile.ts": "React Query hooks for reading and updating the authenticated user's profile via the backend.",
  "frontend/src/App.tsx": "Root React component managing game state transitions, profile setup flow, and theme/query providers.",
  "frontend/src/auth/LoginButton.tsx": "Button component handling Internet Identity login/logout and clearing React Query cache on logout.",
  "frontend/src/auth/ProfileSetupDialog.tsx": "Modal dialog for first‑time users to submit a display name and create their profile.",
  "frontend/src/components/GameHUD.tsx": "Displays score, streak, coins, timer, and pause controls over the game view.",
  "frontend/src/components/LeaderboardPanel.tsx": "Shows daily and all‑time leaderboards with tabs, loading states, and close controls.",
  "frontend/src/components/SettingsDialog.tsx": "Provides UI for toggling sound, reduced motion, and editing key bindings.",
  "frontend/src/game/audio/sfx.ts": "Implements simple oscillator‑based hit, coin, and power‑up sound effects.",
  "frontend/src/game/balance/difficulty.ts": "Calculates time‑based difficulty scaling for obstacle speed, spawn rate, and score multiplier.",
  "frontend/src/game/fx/particles.ts": "Generates particle burst effects with randomized velocity and size.",
  "frontend/src/game/fx/screenShake.ts": "Returns screen‑shake intensity used during rendering.",
  "frontend/src/game/GameCanvas.tsx": "Sets up the game canvas, handles resizing and rendering loop, and connects game state updates.",
  "frontend/src/game/gameTypes.ts": "Defines TypeScript interfaces for all game entities, input state, and game state.",
  "frontend/src/game/input/usePlayerInput.ts": "Tracks pointer and keyboard input to update normalized player target position.",
  "frontend/src/game/renderer.ts": "Renders the full game scene including player, obstacles, power‑ups, particles, background, and effects.",
  "frontend/src/game/useGameLoop.ts": "Implements the main game loop, handling time updates, spawning entities, movement, collisions, scoring, and game-over logic.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for managing Internet Identity login, stored identities, and authentication state.",
  "frontend/src/hooks/useQueries.ts": "Defines mutations for submitting scores and unlocking perks using the backend actor, with leaderboard cache invalidation.",
  "frontend/src/index.css": "Sets global Tailwind layers, theme variables, fonts, and base styling for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/GameScreen.tsx": "Renders the gameplay screen, controlling pause state, settings visibility, and passing event handlers to the canvas and HUD.",
  "frontend/src/pages/LandingScreen.tsx": "Displays the main menu with login, start game button, leaderboard, unlocks, and settings panels.",
  "frontend/src/pages/ResultsScreen.tsx": "Displays game results, awards coins, and auto-submits scores if authenticated, showing stats and restart/menu actions.",
  "frontend/src/progression/perks.ts": "Defines the Perk type and a list of available gameplay and cosmetic perks with costs and icons.",
  "frontend/src/progression/UnlocksShop.tsx": "Renders a shop UI where players can spend coins to unlock perks, handling affordability and unlock actions.",
  "frontend/src/progression/useProgression.ts": "Manages player progression state in localStorage, including coins, best score, and unlocked perks with backend sync.",
  "frontend/src/settings/settingsTypes.ts": "Provides settings and keybinding interfaces along with default settings values.",
  "frontend/src/settings/useSettings.ts": "Loads, stores, and updates user settings in localStorage using a custom hook.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters with hash and query support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins for the frontend UI.",
  "project_state.json": "Defines the project’s current state, including version info, overall game goals, required images, and a list of planned gameplay, UI, progression, and system features. Serves as a roadmap for building an arcade-style game with polish, progression, identity integration, and accessibility."
}