{
  "kind": "build_request",
  "title": "Rename to Neon Doge, fix multiplier + blue ball reset, and correct fullscreen height compression",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Change the app/game title text to \"Neon Doge\" everywhere it is user-visible, including the browser tab title and the landing screen header/hero text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-8"
        ],
        "quotes": [
          "1)  change the title to Neon Doge"
        ]
      },
      "acceptanceCriteria": [
        "The HTML document <title> in frontend/index.html is \"Neon Doge\".",
        "The landing screen title text currently shown as \"NEON DODGE\" is updated to \"NEON DOGE\" (and any related alt text using \"Neon Dodge\" is updated to \"Neon Doge\").",
        "No remaining user-facing occurrences of the old title spelling (\"Neon Dodge\") remain in the UI."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix the in-game multiplier so that it reliably affects scoring during gameplay and is reflected in the HUD as the current multiplier value.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-8"
        ],
        "quotes": [
          "2) the multiplier isnt working"
        ]
      },
      "acceptanceCriteria": [
        "During an active run, the score increases in a way that changes when the multiplier changes (i.e., the multiplier has a measurable effect on points gained over time).",
        "The HUD shows the current multiplier value (not only the streak label) and it updates live as gameplay events change the multiplier.",
        "The multiplier logic is driven by game state (not hardcoded in the renderer) and remains consistent after pausing/resuming."
      ]
    },
    {
      "id": "REQ-3",
      "text": "When the player collides with a blue ball power-up, reset the multiplier back to its base value immediately.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-8"
        ],
        "quotes": [
          "3) when touching a blue ball, the multiplier should be reset"
        ]
      },
      "acceptanceCriteria": [
        "Collecting a coin-type power-up increases the multiplier as intended by the game design.",
        "Collecting the blue ball power-up (currently rendered as the shield-colored power-up) resets the multiplier to its base value in the same frame/tick the collision is processed.",
        "After collecting a blue ball, subsequent scoring uses the reset multiplier until increased again by the relevant mechanic."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Fix fullscreen/responsive layout so that vertical screen space is not compressed in fullscreen mode, and the gameplay view maintains consistent vertical sizing across view widths (mobile/desktop).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-8"
        ],
        "quotes": [
          "4) When viewing full screen the vertical screen space becomes compressed, fix this. In all view wids the vertical space should be consistent"
        ]
      },
      "acceptanceCriteria": [
        "Entering fullscreen does not change the gameplay view into a vertically compressed layout (canvas fills the intended viewport height).",
        "On mobile browsers with dynamic address bars, the gameplay view height remains stable (uses a dynamic viewport height strategy rather than only 100vh).",
        "The canvas resize logic uses the actual visual viewport size when available so rendering matches the displayed canvas size.",
        "HUD overlays remain correctly positioned at the top and bottom edges after resizing/fullscreen changes."
      ]
    }
  ],
  "constraints": [
    "Frontend files in immutablePaths must not be edited (compose/read-only components only)."
  ],
  "nonGoals": [
    "Adding new power-up types beyond the existing ones (coin/shield).",
    "Changing backend score submission/leaderboard logic.",
    "Introducing new authentication or persistence features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}