{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Neon Doge title update, multiplier fixes, and fullscreen viewport sizing",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Rename the game to \"Neon Doge\" across the browser tab title and all user-visible landing UI text/alt text.",
      "acceptanceCriteria": [
        "The HTML document <title> in frontend/index.html is \"Neon Doge\".",
        "The landing screen title text currently shown as \"NEON DODGE\" is updated to \"NEON DOGE\" (and any related alt text using \"Neon Dodge\" is updated to \"Neon Doge\").",
        "No remaining user-facing occurrences of the old title spelling (\"Neon Dodge\") remain in the UI."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the document <title> text to \"Neon Doge\"."
        },
        {
          "path": "frontend/src/pages/LandingScreen.tsx",
          "operation": "modify",
          "description": "Update landing header/hero title text from \"NEON DODGE\" to \"NEON DOGE\" and update logo alt text from \"Neon Dodge\" to \"Neon Doge\"."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make multiplier a first-class part of game state that affects scoring and is displayed live in the HUD (and remains consistent through pause/resume).",
      "acceptanceCriteria": [
        "During an active run, the score increases in a way that changes when the multiplier changes (i.e., the multiplier has a measurable effect on points gained over time).",
        "The HUD shows the current multiplier value (not only the streak label) and it updates live as gameplay events change the multiplier.",
        "The multiplier logic is driven by game state (not hardcoded in the renderer) and remains consistent after pausing/resuming."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/gameTypes.ts",
          "operation": "modify",
          "description": "Extend the GameState type to include a numeric multiplier value (stored in state, not derived only in rendering)."
        },
        {
          "path": "frontend/src/game/useGameLoop.ts",
          "operation": "modify",
          "description": "Introduce and maintain a multiplier field in the game loop state; ensure scoring calculations use the current state multiplier and that multiplier updates are applied within the same tick as gameplay events. Keep multiplier stable across pause/resume by relying on stored gameState rather than recomputation."
        },
        {
          "path": "frontend/src/pages/GameScreen.tsx",
          "operation": "modify",
          "description": "Track current multiplier in the screen-level state (similar to score/streak/coins) and pass it to the HUD; wire a new onMultiplierUpdate callback from GameCanvas/useGameLoop into GameScreen state."
        },
        {
          "path": "frontend/src/game/GameCanvas.tsx",
          "operation": "modify",
          "description": "Add a new onMultiplierUpdate prop and forward it into useGameLoop so multiplier changes propagate to the HUD in real time."
        },
        {
          "path": "frontend/src/components/GameHUD.tsx",
          "operation": "modify",
          "description": "Add a multiplier display in the HUD that shows the current multiplier value (separate from the streak label) and updates live based on props."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Reset multiplier to its base value immediately upon collecting the blue ball (currently the shield-colored power-up), while coin power-ups increase multiplier as intended.",
      "acceptanceCriteria": [
        "Collecting a coin-type power-up increases the multiplier as intended by the game design.",
        "Collecting the blue ball power-up (currently rendered as the shield-colored power-up) resets the multiplier to its base value in the same frame/tick the collision is processed.",
        "After collecting a blue ball, subsequent scoring uses the reset multiplier until increased again by the relevant mechanic."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/useGameLoop.ts",
          "operation": "modify",
          "description": "Update power-up collision handling so that coin power-ups increase the multiplier and shield/blue-ball power-ups reset multiplier to base immediately within the collision processing tick; ensure the scoring calculation after collision uses the updated multiplier for that tick."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Fix fullscreen and responsive sizing so the gameplay view uses stable visual viewport height (no vertical compression) and the canvas resize logic matches the actual displayed size, keeping HUD overlays correctly positioned.",
      "acceptanceCriteria": [
        "Entering fullscreen does not change the gameplay view into a vertically compressed layout (canvas fills the intended viewport height).",
        "On mobile browsers with dynamic address bars, the gameplay view height remains stable (uses a dynamic viewport height strategy rather than only 100vh).",
        "The canvas resize logic uses the actual visual viewport size when available so rendering matches the displayed canvas size.",
        "HUD overlays remain correctly positioned at the top and bottom edges after resizing/fullscreen changes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useVisualViewport.ts",
          "operation": "create",
          "description": "Create a small hook that derives stable viewport dimensions using window.visualViewport when available, and updates a CSS variable (for app height) on resize/orientation/fullscreen changes."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the visual viewport sizing hook so the CSS viewport-height variable is initialized and kept up to date for the entire app (including fullscreen transitions)."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add a dynamic viewport height strategy via a CSS variable (e.g., --app-height) and ensure root/body containers can size to it so fullscreen/mobile address-bar changes don't compress the gameplay view."
        },
        {
          "path": "frontend/src/pages/GameScreen.tsx",
          "operation": "modify",
          "description": "Replace fixed h-screen usage with sizing that respects the dynamic app height variable (and keep the container relative) so HUD overlays remain pinned to the top/bottom edges after resizes/fullscreen changes."
        },
        {
          "path": "frontend/src/game/GameCanvas.tsx",
          "operation": "modify",
          "description": "Update canvas resizing to prefer visual viewport dimensions when available and to keep canvas drawing buffer in sync with its displayed size (including handling devicePixelRatio for crisp rendering); ensure resize runs on visualViewport resize/fullscreen changes, not only window resize."
        }
      ]
    }
  ]
}